230227_daily_report.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-27 Mon 13:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ShapeMaster daily report</title>
<meta name="author" content="syryu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ShapeMaster daily report</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5ec15b1">1. test-environment information</a></li>
<li><a href="#org662f976">2. basic operation result</a>
<ul>
<li><a href="#org1caa996">2.1. Main</a></li>
<li><a href="#org191a9e2">2.2. Model</a></li>
<li><a href="#org7d9c0ed">2.3. ML Library</a></li>
<li><a href="#org244316b">2.4. Parameter</a></li>
<li><a href="#orgbadd8ec">2.5. Batch</a>
<ul>
<li><a href="#org0f56192">2.5.1. setup</a></li>
<li><a href="#orgcd83d9d">2.5.2. Logs</a></li>
<li><a href="#org4ed93ac">2.5.3. Utility</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org96aee4c">3. test-1</a></li>
<li><a href="#org27ee3b7">4. test-2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5ec15b1" class="outline-2">
<h2 id="org5ec15b1"><span class="section-number-2">1.</span> test-environment information</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">deploy</td>
<td class="org-left">no install</td>
<td class="org-left">exe + libraries</td>
<td class="org-left">gitlab (auros-internal)</td>
</tr>

<tr>
<td class="org-left">operating OS</td>
<td class="org-left">windows 10</td>
<td class="org-left">notebook(LG syryu)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">network</td>
<td class="org-left">wifi(ALab-office)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">API path</td>
<td class="org-left">proxy server</td>
<td class="org-left"><a href="http://192.168.14.121/chaos">http://192.168.14.121/chaos</a></td>
<td class="org-left">bastion-ip 20.20.100.1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org662f976" class="outline-2">
<h2 id="org662f976"><span class="section-number-2">2.</span> basic operation result</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1caa996" class="outline-3">
<h3 id="org1caa996"><span class="section-number-3">2.1.</span> Main</h3>
</div>
<div id="outline-container-org191a9e2" class="outline-3">
<h3 id="org191a9e2"><span class="section-number-3">2.2.</span> Model</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">function</th>
<th scope="col" class="org-left">detail</th>
<th scope="col" class="org-left">confirm</th>
<th scope="col" class="org-right">comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GUI windows</td>
<td class="org-left">open</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">font</td>
<td class="org-left">break</td>
<td class="org-left">no</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">menu bar</td>
<td class="org-left">open</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hierachy</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sub-menu</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">model</td>
<td class="org-left">ok</td>
<td class="org-right">2,5</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">configuration</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">store</td>
<td class="org-left">ok</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3D Model</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">display</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">rotate</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">scale</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">move</td>
<td class="org-left">ok</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">re-tile</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">color-change</td>
<td class="org-left">no</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">axis control</td>
<td class="org-left">ok</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">spectrum</td>
<td class="org-left">load</td>
<td class="org-left">ok</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">simulated</td>
<td class="org-left">ok</td>
<td class="org-right">3, 4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">etc</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>comment</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">1. hope to add &rsquo;axis-fix&rsquo; function</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2. need related response to 3D model layer, hope to display for a selected block</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3. <del>simulation spectrum of alpha is flipped (upside down)</del></td>
<td class="org-left">:</td>
<td class="org-left">Done</td>
<td class="org-right">230224</td>
</tr>

<tr>
<td class="org-left">4. hope to display title, ex) Alpha, Beta</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">5. hope to display block color for easy recognition</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">6. Material model config didn`t work</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">7. hope to add &rsquo;pre-defined view button for genuine user&rsquo;</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">8. clear calculated spectrum</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">9. fatal error:</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Fatal error report</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">reason</td>
<td class="org-left">solve</td>
<td class="org-left">comment</td>
</tr>

<tr>
<td class="org-left">1. there is no model defined properly</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1. disable contols that have not to be activate</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2. make error message when error occurs</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7d9c0ed" class="outline-3">
<h3 id="org7d9c0ed"><span class="section-number-3">2.3.</span> ML Library</h3>
</div>
<div id="outline-container-org244316b" class="outline-3">
<h3 id="org244316b"><span class="section-number-3">2.4.</span> Parameter</h3>
</div>
<div id="outline-container-orgbadd8ec" class="outline-3">
<h3 id="orgbadd8ec"><span class="section-number-3">2.5.</span> Batch</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org0f56192" class="outline-4">
<h4 id="org0f56192"><span class="section-number-4">2.5.1.</span> setup</h4>
</div>
<div id="outline-container-orgcd83d9d" class="outline-4">
<h4 id="orgcd83d9d"><span class="section-number-4">2.5.2.</span> Logs</h4>
</div>
<div id="outline-container-org4ed93ac" class="outline-4">
<h4 id="org4ed93ac"><span class="section-number-4">2.5.3.</span> Utility</h4>
</div>
</div>
</div>

<div id="outline-container-org96aee4c" class="outline-2">
<h2 id="org96aee4c"><span class="section-number-2">3.</span> test-1</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">info</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Model</td>
<td class="org-left">Import from JSON</td>
<td class="org-left">internal library</td>
<td class="org-left">Golden test</td>
<td class="org-left">2 films</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">gr2</td>
<td class="org-left">const</td>
<td class="org-left">cube</td>
<td class="org-left">bot w:100, l:100</td>
<td class="org-left">top w:100,l:100</td>
<td class="org-left">h:20</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">gr1</td>
<td class="org-left">const</td>
<td class="org-left">cube</td>
<td class="org-left">bot w:100, l:100</td>
<td class="org-left">top w:100,l:100</td>
<td class="org-left">h:20</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sub</td>
<td class="org-left">const</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">air</td>
<td class="org-left">const</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">path</td>
<td class="org-left">proxy server</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">result</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">spectrum</td>
<td class="org-left">measured</td>
<td class="org-left">open</td>
<td class="org-left">correct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">calculated</td>
<td class="org-left">open</td>
<td class="org-left">well-matched</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">job</td>
<td class="org-left">submit</td>
<td class="org-left">~ 8.5sec</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">get result</td>
<td class="org-left">immediately</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>comment</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">1. option for define path not working</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org27ee3b7" class="outline-2">
<h2 id="org27ee3b7"><span class="section-number-2">4.</span> test-2</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">info</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Model</td>
<td class="org-left">Load Json Path</td>
<td class="org-left">internal library</td>
<td class="org-left">Standard Example1</td>
<td class="org-left">one layer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">path</td>
<td class="org-left">proxy server</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">result</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">spectrum</td>
<td class="org-left">measured</td>
<td class="org-left">no data</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">calculated</td>
<td class="org-left">not displayed</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">job</td>
<td class="org-left">submit</td>
<td class="org-left">immediately</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">get result</td>
<td class="org-left">immediately</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>comment</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">1. option for define path not working</td>
<td class="org-left">:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: syryu</p>
<p class="date">Created: 2023-02-27 Mon 13:04</p>
</div>
</body>
</html>
